FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC546xx/LPC546xx_Timer.c
/*-------------------------------------------------------------------------*
 * File:  Timer.c
 *-------------------------------------------------------------------------*
 * Description:
 *      HAL implementation of the LPC546xx Timers Interface.
 * Implementation:
 *      Two Timers are created, Timer0 and Timer1.
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2015 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZLicense.txt or visit http://www.teamfdi.com/uez for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(R) to your own hardware!  |
 *    |             We can get you up and running fast!               |
*    |      See http://goo.gl/UDtTCR for more details.               |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/
#include <Config.h>
#include <uEZTypes.h>
#include <uEZErrors.h>
#include <uEZProcessor.h>
#include <HAL/GPIO.h>
#include <HAL/Timer.h>
#include <uEZBSP.h>
#include <Source/Processor/NXP/LPC546xx/LPC546xx_Timer.h>
#include <HAL/Interrupt.h>
#include <uEZPlatformAPI.h>

/*---------------------------------------------------------------------------*
 * Types:
 *---------------------------------------------------------------------------*/
typedef struct {
    TVUInt32 iIR; // 0x00
    TVUInt32 iTCR; // 0x04
    TVUInt32 iTC; // 0x08
    TVUInt32 iPR; // 0x0C
    TVUInt32 iPC; // 0x10
    TVUInt32 iMCR; // 0x14
    TVUInt32 iMR[4]; // 0x18, 0x1C, 0x20, 0x24
    TVUInt32 iCCR; // 0x28
    TVUInt32 iCR[4]; // 0x2C, 0x30, 0x34, 0x38
    TVUInt32 iEMR; // 0x3C
    TVUInt32 ireserved1[4]; // 0x40, 0x44, 0x48, 0x4C
    TVUInt32 ireserved2[4]; // 0x50, 0x54, 0x58, 0x5C
    TVUInt32 ireserved3[4]; // 0x60, 0x64, 0x68, 0x6C
    TVUInt32 iCTCR; // 0x70
} T_LPC546xx_Timer_Registers;

typedef struct {
    TUInt16 iVector;
    TISRFPtr iISR;
    const char *iName;
    TUInt8 iPCONBitIndex;
} T_LPC546xx_Timer_Info;

typedef struct {
    T_HALTimer_Callback iCallbackFunc;
    void *iCallbackWorkspace;
} T_LPC546xx_Timer_InterruptCallback;

typedef struct {
    const HAL_Timer *iHAL;
    T_LPC546xx_Timer_Registers *iReg;
    T_LPC546xx_Timer_InterruptCallback iCallbacks[4]; // one per match register
    const T_LPC546xx_Timer_Info *iInfo;
} T_LPC546xx_Timer_Workspace;

/*---------------------------------------------------------------------------*
 * Prototypes:
 *---------------------------------------------------------------------------*/
static const T_LPC546xx_Timer_Info G_Timer0_Info;
static const T_LPC546xx_Timer_Info G_Timer1_Info;
static const T_LPC546xx_Timer_Info G_Timer2_Info;
static const T_LPC546xx_Timer_Info G_Timer3_Info;
T_LPC546xx_Timer_Workspace *G_Timer0_Workspace;
T_LPC546xx_Timer_Workspace *G_Timer1_Workspace;
T_LPC546xx_Timer_Workspace *G_Timer2_Workspace;
T_LPC546xx_Timer_Workspace *G_Timer3_Workspace;
static void ITimerProcessIRQ(T_LPC546xx_Timer_Workspace *p);

/*---------------------------------------------------------------------------*
 * Routine:  TimerX_ISR
 *---------------------------------------------------------------------------*
 * Description:
 *      Interrupt service routines
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE(Timer0_ISR)
{
    IRQ_START();
    ITimerProcessIRQ(G_Timer0_Workspace);
    IRQ_END()
    ;
}

IRQ_ROUTINE(Timer1_ISR)
{
    IRQ_START();
    ITimerProcessIRQ(G_Timer1_Workspace);
    IRQ_END()
    ;
}

IRQ_ROUTINE(Timer2_ISR)
{
    IRQ_START();
    ITimerProcessIRQ(G_Timer2_Workspace);
    IRQ_END()
    ;
}

IRQ_ROUTINE(Timer3_ISR)
{
    IRQ_START();
    ITimerProcessIRQ(G_Timer3_Workspace);
    IRQ_END()
    ;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_Timer_SetTimerMode
 *---------------------------------------------------------------------------*
 * Description:
 *      Timer is going to start -- chip select enabled for device
 * Inputs:
 *      void *aWorkspace        -- Workspace for Timer
 *      T_Timer_Mode aMode      -- Timer mode of operation
 * Outputs:
 *      T_uezError              -- UEZ_ERROR_NONE if success, else code.
 *---------------------------------------------------------------------------*/
static T_uezError LPC546xx_Timer_SetTimerMode(
        void *aWorkspace,
        T_Timer_Mode aMode)
{
    T_LPC546xx_Timer_Workspace *p = (T_LPC546xx_Timer_Workspace *)aWorkspace;
    T_LPC546xx_Timer_Registers *r = p->iReg;

    // Setup the mode
    r->iCTCR = (r->iCTCR & ~3) | aMode;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_Timer_SetCaptureSource
 *---------------------------------------------------------------------------*
 * Description:
 *      Timer is going to start -- chip select enabled for device
 * Inputs:
 *      void *aWorkspace        -- Workspace for Timer
 *      TUInt32 aSourceIndex    -- Timer capture source (depends on hardware
 *                                   underneath).
 * Outputs:
 *      T_uezError              -- Error code.  UEZ_ERROR_NONE if success.
 *                                  UEZ_ERROR_NOT_FOUND if source index
 *                                  does not exist.
 *---------------------------------------------------------------------------*/
static T_uezError LPC546xx_Timer_SetCaptureSource(
        void *aWorkspace,
        TUInt32 aSourceIndex)
{
    T_LPC546xx_Timer_Workspace *p = (T_LPC546xx_Timer_Workspace *)aWorkspace;
    T_LPC546xx_Timer_Registers *r = p->iReg;

    if (aSourceIndex > 4)
        return UEZ_ERROR_NOT_FOUND;

    // Setup the source of the capture
    r->iCTCR = (r->iCTCR & ~(3 << 2)) | (aSourceIndex << 2);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_Timer_SetMatchRegister
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup one of several timer's match registers and what do on
 *      a match.
 * Outputs:
 *      void *aWorkspace        -- Timer's workspace
 *      TUInt8 aMatchRegister   -- Index to match register (0-3)
 *      TUInt32 aMatchPoint     -- Number of CPU cycles until match
 *      TBool aDoInterrupt      -- ETrue if want an interrupt, else EFalse
 *                                  (NOTE: Interrupts currently not
 *                                  implemented)
 *      TBool aDoCounterReset   -- ETrue if counter for this Timer is
 *                                  to be reset on match.
 *      TBool aDoStop           -- ETrue if counter is to be stopped
 *                                  when match occurs.
 *---------------------------------------------------------------------------*/
static T_uezError LPC546xx_Timer_SetMatchRegister(
        void *aWorkspace,
        TUInt8 aMatchRegister,
        TUInt32 aMatchPoint,
        TBool aDoInterrupt,
        TBool aDoCounterReset,
        TBool aDoStop)
{
    T_LPC546xx_Timer_Workspace *p = (T_LPC546xx_Timer_Workspace *)aWorkspace;
    T_LPC546xx_Timer_Registers *r = p->iReg;
    TUInt32 aFlags = 0;

    // Determine if legal match register
    if (aMatchRegister >= 4)
        return UEZ_ERROR_ILLEGAL_PARAMETER;

    // Determine what the combined flags are
    if (aDoInterrupt)
        aFlags |= (1 << 0);
    if (aDoCounterReset)
        aFlags |= (1 << 1);
    if (aDoStop)
        aFlags |= (1 << 2);

