FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC546xx/LPC546xx_Timer.c
    // Set the actions on the match
    r->iMCR &= ~(7 << (aMatchRegister * 3));
    r->iMCR |= (aFlags << (aMatchRegister * 3));

    // Change the match register
    r->iMR[aMatchRegister] = aMatchPoint / (PROCESSOR_OSCILLATOR_FREQUENCY
        / PCLK_FREQUENCY);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_Timer_SetExternalControl
 *---------------------------------------------------------------------------*
 * Description:
 *      Timer is going to have a single edge output (high until matches, then
 *      low, reset counter goes back to high).
 * Inputs:
 *      void *aWorkspace        -- Timer's workspace
 *      TUInt8 aMatchRegister   -- Point in Fpclk cycles where Timer switches
 * Outputs:
 *      T_uezError              -- UEZ_ERROR_NONE
 *---------------------------------------------------------------------------*/
static T_uezError LPC546xx_Timer_SetExternalControl(
        void *aWorkspace,
        TUInt8 aMatchRegister,
        T_Timer_ExternalControl aExtControl)
{
    T_LPC546xx_Timer_Workspace *p = (T_LPC546xx_Timer_Workspace *)aWorkspace;
    T_LPC546xx_Timer_Registers *r = p->iReg;

    // Determine if legal match register
    if (aMatchRegister >= 4)
        return UEZ_ERROR_ILLEGAL_PARAMETER;

    // Change the external control
    r->iEMR &= ~(3 << (4 + aMatchRegister * 2));
    r->iEMR |= (aExtControl << (4 + aMatchRegister * 2));

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_Timer_Reset
 *---------------------------------------------------------------------------*
 * Description:
 *      Reset the timer's counter.
 * Inputs:
 *      void *aWorkspace        -- Timer's workspace
 *---------------------------------------------------------------------------*/
static void LPC546xx_Timer_Reset(void *aWorkspace)
{
    T_LPC546xx_Timer_Workspace *p = (T_LPC546xx_Timer_Workspace *)aWorkspace;
    T_LPC546xx_Timer_Registers *r = p->iReg;
    int i;

    // Reset the counter
    r->iTCR |= (1 << 1);

    // Small delay to let the timer reset
    for (i = 0; i < 5; i++) {
    }

    // Release the counter
    r->iTCR &= ~(1 << 1);
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_Timer_Enable
 *---------------------------------------------------------------------------*
 * Description:
 *      Enable (run) the timer's counter.
 * Inputs:
 *      void *aWorkspace        -- Timer's workspace
 *---------------------------------------------------------------------------*/
static void LPC546xx_Timer_Enable(void *aWorkspace)
{
    T_LPC546xx_Timer_Workspace *p = (T_LPC546xx_Timer_Workspace *)aWorkspace;
    T_LPC546xx_Timer_Registers *r = p->iReg;

    // Enable the counter
    r->iTCR |= (1 << 0);
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_Timer_Disable
 *---------------------------------------------------------------------------*
 * Description:
 *      Disable the timer's counter.
 * Inputs:
 *      void *aWorkspace        -- Timer's workspace
 *---------------------------------------------------------------------------*/
static void LPC546xx_Timer_Disable(void *aWorkspace)
{
    T_LPC546xx_Timer_Workspace *p = (T_LPC546xx_Timer_Workspace *)aWorkspace;
    T_LPC546xx_Timer_Registers *r = p->iReg;

    // Disable the counter
    r->iTCR &= ~(1 << 0);
}

/*---------------------------------------------------------------------------*
 * Routine:  ITimerProcessIRQ
 *---------------------------------------------------------------------------*
 * Description:
 *      Routine called when IRQ occurs.  Determines which callbacks to
 *      call (if any) and clears the interrupts.
 * Inputs:
 *      T_LPC247x_Timer_Workspace *p -- Timer workspace
 *---------------------------------------------------------------------------*/
static void ITimerProcessIRQ(T_LPC546xx_Timer_Workspace *p)
{
    // Look at the registers and see which are causing an interrupt
    TUInt8 ir = p->iReg->iIR;
    if (ir & (1 << 0)) {
        // Match register 0
        if (p->iCallbacks[0].iCallbackFunc)
            p->iCallbacks[0].iCallbackFunc(p->iCallbacks[0].iCallbackWorkspace);
    }
    if (ir & (1 << 1)) {
        // Match register 1
        if (p->iCallbacks[1].iCallbackFunc)
            p->iCallbacks[1].iCallbackFunc(p->iCallbacks[1].iCallbackWorkspace);
    }
    if (ir & (1 << 2)) {
        // Match register 2
        if (p->iCallbacks[2].iCallbackFunc)
            p->iCallbacks[2].iCallbackFunc(p->iCallbacks[2].iCallbackWorkspace);
    }
    if (ir & (1 << 3)) {
        // Match register 3
        if (p->iCallbacks[3].iCallbackFunc)
            p->iCallbacks[3].iCallbackFunc(p->iCallbacks[3].iCallbackWorkspace);
    }
    // Clear interrupts called in this pass (if another one came in, we'll get it
    // on the next interrupt).
    p->iReg->iIR = ir;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC247x_Timer_SetMatchCallback
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup a callback routine for this timer on one of the match
 *      registers.  The callback is called when a match occurs and an
 *      interrupt occurs.  The callback is called from within the ISR.
 * Inputs:
 *      void *aWorkspace -- Timer workspace
 *      TUInt8 aMatchRegister -- Which match register to set callback
 *      T_Timer_Callback aCallbackFunc -- Function to call, or 0 to clear.
 *      void *aCallbackWorkspace -- Workspace to pass to callback
 * Outputs:
 *      T_uezError -- UEZ_ERROR_ILLEGAL_PARAMETER if match register is out
 *          of range.
 *---------------------------------------------------------------------------*/
static T_uezError LPC546xx_Timer_SetMatchCallback(
        void *aWorkspace,
        TUInt8 aMatchRegister,
        T_HALTimer_Callback aCallbackFunc,
        void *aCallbackWorkspace)
{
    T_LPC546xx_Timer_Workspace *p = (T_LPC546xx_Timer_Workspace *)aWorkspace;
    TBool any;
    TUInt8 i;

    // Determine if legal match register
    if (aMatchRegister >= 4)
        return UEZ_ERROR_ILLEGAL_PARAMETER;

    // Set the callback (which can be 0 as well as an address)
    p->iCallbacks[aMatchRegister].iCallbackFunc = aCallbackFunc;
    p->iCallbacks[aMatchRegister].iCallbackWorkspace = aCallbackWorkspace;

