FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC546xx/LPC546xx_Timer.c
    // Set the actions on the match
    r->iMCR &= ~(7 << (aMatchRegister * 3));
    r->iMCR |= (aFlags << (aMatchRegister * 3));

    // Change the match register
    r->iMR[aMatchRegister] = aMatchPoint / (PROCESSOR_OSCILLATOR_FREQUENCY
        / PCLK_FREQUENCY);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Internal Information tables:
 *---------------------------------------------------------------------------*/
static const T_LPC546xx_Timer_Info G_Timer0_Info = {
        TIMER0_IRQn,
        (TISRFPtr)Timer0_ISR,
        "Timer0",
        1, };

static const T_LPC546xx_Timer_Info G_Timer1_Info = {
        TIMER1_IRQn,
        (TISRFPtr)Timer1_ISR,
        "Timer1",
        2, };

static const T_LPC546xx_Timer_Info G_Timer2_Info = {
        TIMER2_IRQn,
        (TISRFPtr)Timer2_ISR,
        "Timer2",
        22, };

static const T_LPC546xx_Timer_Info G_Timer3_Info = {
        TIMER3_IRQn,
        (TISRFPtr)Timer3_ISR,
        "Timer3",
        23, };

/*---------------------------------------------------------------------------*
 * HAL Interface table:
 *---------------------------------------------------------------------------*/
const HAL_Timer LPC546xx_Timer0_Interface = {
    {
    "NXP:LPC546xx:Timer0",
    0x0100,
    LPC546xx_Timer0_InitializeWorkspace,
    sizeof(T_LPC546xx_Timer_Workspace),
    },

    LPC546xx_Timer_SetTimerMode,
    LPC546xx_Timer_SetCaptureSource,
    LPC546xx_Timer_SetMatchRegister,
    LPC546xx_Timer_SetExternalControl,
    LPC546xx_Timer_Reset,
    LPC546xx_Timer_Enable,
    LPC546xx_Timer_Disable,
    LPC546xx_Timer_SetMatchCallback,
    LPC546xx_Timer_SetMatchRegisterFunctions,
};

const HAL_Timer LPC546xx_Timer1_Interface = {
    {
    "NXP:LPC546xx:Timer1",
    0x0100,
    LPC546xx_Timer1_InitializeWorkspace,
    sizeof(T_LPC546xx_Timer_Workspace),
    },

    LPC546xx_Timer_SetTimerMode,
    LPC546xx_Timer_SetCaptureSource,
    LPC546xx_Timer_SetMatchRegister,
    LPC546xx_Timer_SetExternalControl,
    LPC546xx_Timer_Reset,
    LPC546xx_Timer_Enable,
    LPC546xx_Timer_Disable,
    LPC546xx_Timer_SetMatchCallback,
    LPC546xx_Timer_SetMatchRegisterFunctions,
};

const HAL_Timer LPC546xx_Timer2_Interface = {
    {
    "NXP:LPC546xx:Timer2",
    0x0100,
    LPC546xx_Timer2_InitializeWorkspace,
    sizeof(T_LPC546xx_Timer_Workspace),
    },

    LPC546xx_Timer_SetTimerMode,
    LPC546xx_Timer_SetCaptureSource,
    LPC546xx_Timer_SetMatchRegister,
    LPC546xx_Timer_SetExternalControl,
    LPC546xx_Timer_Reset,
    LPC546xx_Timer_Enable,
    LPC546xx_Timer_Disable,
    LPC546xx_Timer_SetMatchCallback,
    LPC546xx_Timer_SetMatchRegisterFunctions,
};

const HAL_Timer LPC546xx_Timer3_Interface = {
    {
    "NXP:LPC546xx:Timer3",
    0x0100,
    LPC546xx_Timer3_InitializeWorkspace,
    sizeof(T_LPC546xx_Timer_Workspace),
    },

    LPC546xx_Timer_SetTimerMode,
    LPC546xx_Timer_SetCaptureSource,
    LPC546xx_Timer_SetMatchRegister,
    LPC546xx_Timer_SetExternalControl,
    LPC546xx_Timer_Reset,
    LPC546xx_Timer_Enable,
    LPC546xx_Timer_Disable,
    LPC546xx_Timer_SetMatchCallback,
    LPC546xx_Timer_SetMatchRegisterFunctions,
};

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void LPC546xx_Timer0_Require(const T_LPC546xx_Timer_Settings *aSettings)
{
    static const T_LPC546xx_SCU_ConfigList cap0[] = {
            {GPIO_P4_4     ,IOCON_D_DEFAULT(7)},
    };
    static const T_LPC546xx_SCU_ConfigList cap1[] = {
            {GPIO_P1_5     ,IOCON_D_DEFAULT(3)},
            {GPIO_P4_5     ,IOCON_D_DEFAULT(7)},
    };
    static const T_LPC546xx_SCU_ConfigList cap2[] = {
            {GPIO_P0_15     ,IOCON_D_DEFAULT(4)},
            {GPIO_P4_6     ,IOCON_D_DEFAULT(7)},
    };
    static const T_LPC546xx_SCU_ConfigList cap3[] = {
            {GPIO_P0_4     ,IOCON_D_DEFAULT(4)},
            {GPIO_P4_7     ,IOCON_D_DEFAULT(7)},
    };

    static const T_LPC546xx_SCU_ConfigList mat0[] = {
            {GPIO_P0_3    ,IOCON_D_DEFAULT(4)},
            {GPIO_P4_0    ,IOCON_D_DEFAULT(7)},
    };
    static const T_LPC546xx_SCU_ConfigList mat1[] = {
            {GPIO_P0_2    ,IOCON_D_DEFAULT(4)},
            {GPIO_P4_1    ,IOCON_D_DEFAULT(7)},
    };
    static const T_LPC546xx_SCU_ConfigList mat2[] = {
            {GPIO_P1_7    ,IOCON_D_DEFAULT(4)},
            {GPIO_P4_2    ,IOCON_D_DEFAULT(7)},
    };
    static const T_LPC546xx_SCU_ConfigList mat3[] = {
            {GPIO_P0_13   ,IOCON_D_DEFAULT(4)},
            {GPIO_P4_3    ,IOCON_D_DEFAULT(7)},
    };

    HAL_DEVICE_REQUIRE_ONCE();
    // Register Timer0
    HALInterfaceRegister("Timer0", (T_halInterface *)&LPC546xx_Timer0_Interface,
            0, 0);

    LPC546xx_ICON_ConfigPinOrNone(aSettings->iCAP[0], cap0, ARRAY_COUNT(cap0));
    LPC546xx_ICON_ConfigPinOrNone(aSettings->iCAP[1], cap1, ARRAY_COUNT(cap1));
    LPC546xx_ICON_ConfigPinOrNone(aSettings->iCAP[2], cap2, ARRAY_COUNT(cap2));
    LPC546xx_ICON_ConfigPinOrNone(aSettings->iCAP[3], cap3, ARRAY_COUNT(cap3));

    LPC546xx_ICON_ConfigPinOrNone(aSettings->iMAT[0], mat0, ARRAY_COUNT(mat0));
    LPC546xx_ICON_ConfigPinOrNone(aSettings->iMAT[1], mat1, ARRAY_COUNT(mat1));
    LPC546xx_ICON_ConfigPinOrNone(aSettings->iMAT[2], mat2, ARRAY_COUNT(mat2));
    LPC546xx_ICON_ConfigPinOrNone(aSettings->iMAT[3], mat3, ARRAY_COUNT(mat3));
}

void LPC546xx_Timer1_Require(const T_LPC546xx_Timer_Settings *aSettings)
{
    static const T_LPC546xx_SCU_ConfigList cap0[] = {
            {GPIO_P1_6    , IOCON_D_DEFAULT(4)},
            {GPIO_P2_9    , IOCON_D_DEFAULT(5)},
    };
    static const T_LPC546xx_SCU_ConfigList cap1[] = {
            {GPIO_P2_10   , IOCON_D_DEFAULT(5)},
    };
    static const T_LPC546xx_SCU_ConfigList cap2[] = {
            {GPIO_P2_11   , IOCON_D_DEFAULT(5)},
    };
    static const T_LPC546xx_SCU_ConfigList cap3[] = {
            {GPIO_P2_12   , IOCON_D_DEFAULT(5)},
    };

    static const T_LPC546xx_SCU_ConfigList mat0[] = {
            {GPIO_P2_13   , IOCON_D_DEFAULT(5)},
    };
    static const T_LPC546xx_SCU_ConfigList mat1[] = {
            {GPIO_P2_14   , IOCON_D_DEFAULT(5)},
    };
    static const T_LPC546xx_SCU_ConfigList mat2[] = {
            {GPIO_P2_15   , IOCON_D_DEFAULT(5)},
    };
    static const T_LPC546xx_SCU_ConfigList mat3[] = {
            {GPIO_P2_7    , IOCON_D_DEFAULT(5)},
    };

    HAL_DEVICE_REQUIRE_ONCE();
    // Register Timer1
    HALInterfaceRegister("Timer1", (T_halInterface *)&LPC546xx_Timer1_Interface,
            0, 0);
    LPC546xx_ICON_ConfigPinOrNone(aSettings->iCAP[0], cap0, ARRAY_COUNT(cap0));
    LPC546xx_ICON_ConfigPinOrNone(aSettings->iCAP[1], cap1, ARRAY_COUNT(cap1));
    LPC546xx_ICON_ConfigPinOrNone(aSettings->iCAP[2], cap2, ARRAY_COUNT(cap2));
    LPC546xx_ICON_ConfigPinOrNone(aSettings->iCAP[3], cap3, ARRAY_COUNT(cap3));

    LPC546xx_ICON_ConfigPinOrNone(aSettings->iMAT[0], mat0, ARRAY_COUNT(mat0));
    LPC546xx_ICON_ConfigPinOrNone(aSettings->iMAT[1], mat1, ARRAY_COUNT(mat1));
    LPC546xx_ICON_ConfigPinOrNone(aSettings->iMAT[2], mat2, ARRAY_COUNT(mat2));
    LPC546xx_ICON_ConfigPinOrNone(aSettings->iMAT[3], mat3, ARRAY_COUNT(mat3));
}

void LPC546xx_Timer2_Require(const T_LPC546xx_Timer_Settings *aSettings)
{
    static const T_LPC546xx_SCU_ConfigList cap0[] = {
            {GPIO_P3_0     , IOCON_D_DEFAULT(5)},
    };
    static const T_LPC546xx_SCU_ConfigList cap1[] = {
            {GPIO_P3_1     , IOCON_D_DEFAULT(5)},
    };
    static const T_LPC546xx_SCU_ConfigList cap2[] = {
            {GPIO_P3_2     , IOCON_D_DEFAULT(5)},
    };
    static const T_LPC546xx_SCU_ConfigList cap3[] = {
            {GPIO_P0_5     , IOCON_D_DEFAULT(5)},
    };

    static const T_LPC546xx_SCU_ConfigList mat0[] = {
            {GPIO_P5_15    , IOCON_D_DEFAULT(5)},
    };
    static const T_LPC546xx_SCU_ConfigList mat1[] = {
            {GPIO_P5_16    , IOCON_D_DEFAULT(5)},
    };
    static const T_LPC546xx_SCU_ConfigList mat2[] = {
            {GPIO_P3_5     , IOCON_D_DEFAULT(5)},
    };
    static const T_LPC546xx_SCU_ConfigList mat3[] = {
            {GPIO_P3_7     , IOCON_D_DEFAULT(5)},
    };

    HAL_DEVICE_REQUIRE_ONCE();
    // Register Timer2
    HALInterfaceRegister("Timer2", (T_halInterface *)&LPC546xx_Timer2_Interface,
            0, 0);
    LPC546xx_ICON_ConfigPinOrNone(aSettings->iCAP[0], cap0, ARRAY_COUNT(cap0));
    LPC546xx_ICON_ConfigPinOrNone(aSettings->iCAP[1], cap1, ARRAY_COUNT(cap1));
    LPC546xx_ICON_ConfigPinOrNone(aSettings->iCAP[2], cap2, ARRAY_COUNT(cap2));
    LPC546xx_ICON_ConfigPinOrNone(aSettings->iCAP[3], cap3, ARRAY_COUNT(cap3));

    LPC546xx_ICON_ConfigPinOrNone(aSettings->iMAT[0], mat0, ARRAY_COUNT(mat0));
    LPC546xx_ICON_ConfigPinOrNone(aSettings->iMAT[1], mat1, ARRAY_COUNT(mat1));
    LPC546xx_ICON_ConfigPinOrNone(aSettings->iMAT[2], mat2, ARRAY_COUNT(mat2));
    LPC546xx_ICON_ConfigPinOrNone(aSettings->iMAT[3], mat3, ARRAY_COUNT(mat3));
}

