FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC546xx/LPC546xx_Timer.c
void LPC546xx_Timer3_Require(const T_LPC546xx_Timer_Settings *aSettings)
{
    static const T_LPC546xx_SCU_ConfigList cap0[] = {
            {GPIO_P6_0    , IOCON_D_DEFAULT(6)},
    };
    static const T_LPC546xx_SCU_ConfigList cap1[] = {
            {GPIO_P5_1    , IOCON_D_DEFAULT(6)},
            {GPIO_P6_3    , IOCON_D_DEFAULT(6)},
    };
    static const T_LPC546xx_SCU_ConfigList cap2[] = {
            {GPIO_P5_2    , IOCON_D_DEFAULT(6)},
            {GPIO_P6_4    , IOCON_D_DEFAULT(6)},
    };
    static const T_LPC546xx_SCU_ConfigList cap3[] = {
            {GPIO_P5_6    , IOCON_D_DEFAULT(6)},
            {GPIO_P6_5    , IOCON_D_DEFAULT(6)},
    };

    static const T_LPC546xx_SCU_ConfigList mat0[] = {
            {GPIO_P5_3    , IOCON_D_DEFAULT(6)},
            {GPIO_P6_6    , IOCON_D_DEFAULT(6)},
    };
    static const T_LPC546xx_SCU_ConfigList mat1[] = {
            {GPIO_P5_4    , IOCON_D_DEFAULT(6)},
            {GPIO_P6_7    , IOCON_D_DEFAULT(6)},
    };
    static const T_LPC546xx_SCU_ConfigList mat2[] = {
            {GPIO_P5_5    , IOCON_D_DEFAULT(6)},
            {GPIO_P6_8    , IOCON_D_DEFAULT(6)},
    };
    static const T_LPC546xx_SCU_ConfigList mat3[] = {
            {GPIO_P0_7    , IOCON_D_DEFAULT(6)},
            {GPIO_P6_9    , IOCON_D_DEFAULT(6)},
    };

    HAL_DEVICE_REQUIRE_ONCE();
    // Register Timer3
    HALInterfaceRegister("Timer3", (T_halInterface *)&LPC546xx_Timer3_Interface,
            0, 0);
    LPC546xx_ICON_ConfigPinOrNone(aSettings->iCAP[0], cap0, ARRAY_COUNT(cap0));
    LPC546xx_ICON_ConfigPinOrNone(aSettings->iCAP[1], cap1, ARRAY_COUNT(cap1));
    LPC546xx_ICON_ConfigPinOrNone(aSettings->iCAP[2], cap2, ARRAY_COUNT(cap2));
    LPC546xx_ICON_ConfigPinOrNone(aSettings->iCAP[3], cap3, ARRAY_COUNT(cap3));

    LPC546xx_ICON_ConfigPinOrNone(aSettings->iMAT[0], mat0, ARRAY_COUNT(mat0));
    LPC546xx_ICON_ConfigPinOrNone(aSettings->iMAT[1], mat1, ARRAY_COUNT(mat1));
    LPC546xx_ICON_ConfigPinOrNone(aSettings->iMAT[2], mat2, ARRAY_COUNT(mat2));
    LPC546xx_ICON_ConfigPinOrNone(aSettings->iMAT[3], mat3, ARRAY_COUNT(mat3));
}

/*-------------------------------------------------------------------------*
 * End of File:  Timer.c
 *-------------------------------------------------------------------------*/

